tylertms/kinetis-k22-sim/src/device/kinetis/device.c
#include "kinetis.h"

#include <stdlib.h>
#include <string.h>

#include "device/kinetis/internal.h"

static bool valid_memory_range(uint32_t address, uint8_t access_size, uint32_t region_base,
                               size_t region_size) {
    if (access_size == 0u || address < region_base)
        return false;
    return (uint64_t)address + access_size <= (uint64_t)region_base + region_size;
}

static uint32_t read_little_endian(const uint8_t* input_bytes, uint8_t byte_count) {
    uint32_t output_value = 0u;
    for (uint8_t byte_index = 0u; byte_index < byte_count; byte_index++) {
        output_value |= (uint32_t)input_bytes[byte_index] << (byte_index * 8u);
    }
    return output_value;
}

static void write_little_endian(uint8_t* output_bytes, uint8_t byte_count, uint32_t write_value) {
    for (uint8_t byte_index = 0u; byte_index < byte_count; byte_index++) {
        output_bytes[byte_index] = (uint8_t)(write_value >> (byte_index * 8u));
    }
}

static bool is_flash_access_allowed(const Kinetis* device, CortexM4Access access, uint8_t master,
                                    bool write_access) {
    if (access == CORTEX_M4_ACCESS_DEBUG) {
        return true;
    }
    const uint32_t offset = 0x4001f000u - K22_PERIPHERAL_BASE;
    const uint32_t protection = read_little_endian(device->peripheral + offset, 4u);
    const uint8_t permission = (uint8_t)((protection >> (master * 2u)) & 3u);
    return write_access ? (permission & 2u) != 0u : (permission & 1u) != 0u;
}

static uint32_t fmc_raw_load(const Kinetis* device, uint32_t address) {
    return read_little_endian(device->peripheral + address - K22_PERIPHERAL_BASE, 4u);
}

static void fmc_raw_store(Kinetis* device, uint32_t address, uint32_t write_value) {
    write_little_endian(device->peripheral + address - K22_PERIPHERAL_BASE, 4u, write_value);
}

static uint32_t fmc_tag_address(uint8_t cache_way, uint8_t cache_set) {
    return 0x4001f100u + ((uint32_t)cache_way * 4u + cache_set) * 4u;
}

static uint32_t fmc_data_address(uint8_t cache_way, uint8_t cache_set, uint8_t word_index) {
    return 0x4001f200u + ((uint32_t)cache_way * 4u + cache_set) * 16u + (3u - word_index) * 4u;
}

static uint32_t fmc_tag_value(const Kinetis* device, uint32_t cache_line_address);

static void fmc_clear_entry(Kinetis* device, uint8_t cache_way, uint8_t cache_set) {
    fmc_raw_store(device, fmc_tag_address(cache_way, cache_set), 0u);
    for (uint8_t word_index = 0u; word_index < 4u; word_index++) {
        fmc_raw_store(device, fmc_data_address(cache_way, cache_set, word_index), 0u);
    }
    device->fmc_bank[cache_way][cache_set] = 0u;
    device->fmc_age[cache_way][cache_set] = 0u;
}

static void fmc_clear_cache(Kinetis* device) {
    for (uint8_t cache_way = 0u; cache_way < 4u; cache_way++) {
        for (uint8_t cache_set = 0u; cache_set < 4u; cache_set++) {
            fmc_clear_entry(device, cache_way, cache_set);
        }
    }
    device->fmc_access_count = 0u;
}

static void fmc_invalidate_line(Kinetis* device, uint8_t flash_bank, uint32_t flash_offset) {
    const uint8_t cache_set = (uint8_t)((flash_offset >> 4u) & 3u);
    const uint32_t tag = fmc_tag_value(device, flash_offset & ~15u);
    for (uint8_t cache_way = 0u; cache_way < 4u; cache_way++) {
        if (device->fmc_bank[cache_way][cache_set] == flash_bank &&
            fmc_raw_load(device, fmc_tag_address(cache_way, cache_set)) == tag) {
            fmc_clear_entry(device, cache_way, cache_set);
        }
    }
}

static uint32_t fmc_tag_value(const Kinetis* device, uint32_t cache_line_address) {
    const K22RegisterDescriptor* descriptor =
        k22_register_manifest_lookup(device->profile->id, 0x4001f100u, 32u);
    return (cache_line_address & descriptor->write_mask & ~1u) | 1u;
}

static bool fmc_way_allowed(uint8_t replacement_mode, bool instruction_access, uint8_t cache_way) {
    if (replacement_mode == 2u)
        return instruction_access ? cache_way < 2u : cache_way >= 2u;
    if (replacement_mode == 3u)
        return instruction_access ? cache_way < 3u : cache_way == 3u;
    return true;
}

static uint8_t fmc_replacement_way(Kinetis* device, uint8_t cache_set, bool instruction_access) {
    const uint32_t cache_control = fmc_raw_load(device, 0x4001f004u);
    const uint8_t locked_way_mask = (uint8_t)((cache_control >> 24u) & 0x0fu);
    const uint8_t replacement_mode = (uint8_t)((cache_control >> 5u) & 7u);
    for (uint8_t cache_way = 0u; cache_way < 4u; cache_way++) {
        if ((locked_way_mask & (1u << cache_way)) == 0u &&
            fmc_way_allowed(replacement_mode, instruction_access, cache_way) &&
            (fmc_raw_load(device, fmc_tag_address(cache_way, cache_set)) & 1u) == 0u) {
            return cache_way;
        }
    }
    uint8_t selected_cache_way = UINT8_MAX;
    uint64_t oldest_age = UINT64_MAX;
    for (uint8_t cache_way = 0u; cache_way < 4u; cache_way++) {
        if ((locked_way_mask & (1u << cache_way)) == 0u &&
            fmc_way_allowed(replacement_mode, instruction_access, cache_way) &&
            device->fmc_age[cache_way][cache_set] < oldest_age) {
            selected_cache_way = cache_way;
            oldest_age = device->fmc_age[cache_way][cache_set];
        }
    }
    return selected_cache_way;
}

static uint8_t fmc_source_byte(Kinetis* device, uint8_t flash_bank, uint32_t flash_offset) {
    if (flash_bank == 0u)
        return flash_offset < device->configuration.flash_size
                   ? device->flash[k22_data_program_flash_address(device->data, flash_offset)]
                   : UINT8_MAX;
    uint32_t output_value = UINT32_MAX;
    return k22_data_read(device->data, device->profile->flexnvm_address + flash_offset, 1u,
                         &output_value)
               ? (uint8_t)output_value
               : UINT8_MAX;
}

static uint8_t fmc_cached_byte(Kinetis* device, uint8_t flash_bank, uint32_t flash_offset,
                               CortexM4Access access) {
    const uint32_t cache_line_address = flash_offset & ~15u;
    const uint8_t cache_set = (uint8_t)((flash_offset >> 4u) & 3u);
    const uint32_t tag = fmc_tag_value(device, cache_line_address);
    uint8_t cache_way = UINT8_MAX;
    for (uint8_t candidate_way = 0u; candidate_way < 4u; candidate_way++) {
        if (device->fmc_bank[candidate_way][cache_set] == flash_bank &&
            fmc_raw_load(device, fmc_tag_address(candidate_way, cache_set)) == tag) {
            cache_way = candidate_way;
            break;
        }
    }
    if (cache_way == UINT8_MAX) {
        cache_way = fmc_replacement_way(device, cache_set, access == CORTEX_M4_ACCESS_INSTRUCTION);
        if (cache_way == UINT8_MAX)
            return fmc_source_byte(device, flash_bank, flash_offset);
        for (uint8_t word_index = 0u; word_index < 4u; word_index++) {
            uint32_t cache_word = 0u;
            for (uint8_t byte_index = 0u; byte_index < 4u; byte_index++) {
                const uint32_t source_address =
                    cache_line_address + (uint32_t)word_index * 4u + byte_index;
                cache_word |= (uint32_t)fmc_source_byte(device, flash_bank, source_address)
                              << (byte_index * 8u);
            }
            fmc_raw_store(device, fmc_data_address(cache_way, cache_set, word_index), cache_word);
        }
        fmc_raw_store(device, fmc_tag_address(cache_way, cache_set), tag);
        device->fmc_bank[cache_way][cache_set] = flash_bank;
    }
    device->fmc_age[cache_way][cache_set] = ++device->fmc_access_count;
    const uint8_t word_index = (uint8_t)((flash_offset >> 2u) & 3u);
    return (uint8_t)(fmc_raw_load(device, fmc_data_address(cache_way, cache_set, word_index)) >>
                     ((flash_offset & 3u) * 8u));
}

static bool fmc_cache_enabled(const Kinetis* device, uint8_t bank, CortexM4Access access) {
    if (access == CORTEX_M4_ACCESS_DEBUG)
        return false;
    const uint32_t cache_control = fmc_raw_load(device, 0x4001f004u + (uint32_t)bank * 4u);
    return (cache_control & (access == CORTEX_M4_ACCESS_INSTRUCTION ? 8u : 16u)) != 0u;
}

static bool sysmpu_access_allowed(Kinetis* device, uint32_t address, uint8_t access_size,
                                  uint8_t master, bool supervisor, K22SysMpuAccess access) {
    if (!k22_profile_has_peripheral(device->profile, K22_PERIPHERAL_SYSMPU) ||
        !k22_io_clock_enabled(&device->io, K22_PERIPHERAL_SYSMPU))
        return true;
    if (!k22_io_sysmpu_access(&device->io, address, master, supervisor, access))
        return false;
    return k22_io_sysmpu_access(&device->io, address + access_size - 1u, master, supervisor,
                                access);
}

static bool memory_read_unprotected(Kinetis* device, uint32_t address, uint8_t access_size,
                                    CortexM4Access access, uint8_t flash_master_id,
                                    uint32_t* output_value) {
    if (valid_memory_range(address, access_size, K22_FLASH_BASE,
                           device->configuration.flash_size)) {
        if (!is_flash_access_allowed(device, access, flash_master_id, false)) {
            return false;
        }
        if (!k22_data_flash_read(device->data, false, address, access_size)) {
            *output_value = access_size == 4u ? UINT32_MAX : (1u << (access_size * 8u)) - 1u;
            return true;
        }
        if (fmc_cache_enabled(device, 0u, access)) {
            *output_value = 0u;
            for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
                *output_value |= (uint32_t)fmc_cached_byte(device, 0u, address + byte_index, access)
                                 << (byte_index * 8u);
            }
        } else {
            *output_value = 0u;
            for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
                *output_value |=
                    (uint32_t)device
                        ->flash[k22_data_program_flash_address(device->data, address + byte_index)]
                    << (byte_index * 8u);
            }
        }
        return true;
    }
    if (valid_memory_range(address, access_size, device->sram_base,
                           device->configuration.sram_size)) {
        const uint32_t offset = address - device->sram_base;
        if (access != CORTEX_M4_ACCESS_DEBUG) {
            for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
                if (device->sram_initialized[offset + byte_index] == 0u) {
                    if (device->uninitialized_sram_read_count == 0u) {
                        device->first_uninitialized_sram_read = address + byte_index;
                    }
                    device->uninitialized_sram_read_count++;
                }
            }
        }
        *output_value = read_little_endian(device->sram + address - device->sram_base, access_size);
        return true;
    }
    if (device->profile->flexnvm_size != 0u &&
        valid_memory_range(address, access_size, device->profile->flexnvm_address,
                           device->profile->flexnvm_size)) {
        if (!is_flash_access_allowed(device, access, flash_master_id, false))
            return false;
        const uint32_t offset = address - device->profile->flexnvm_address;
        if (!k22_data_flash_read(device->data, true, offset, access_size)) {
            *output_value = access_size == 4u ? UINT32_MAX : (1u << (access_size * 8u)) - 1u;
            return true;
        }
        if (fmc_cache_enabled(device, 1u, access)) {
            *output_value = 0u;
            for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
                *output_value |= (uint32_t)fmc_cached_byte(device, 1u, offset + byte_index, access)
                                 << (byte_index * 8u);
            }
            return true;
        }
        return k22_data_read(device->data, address, access_size, output_value);
    }
    if (device->profile->flexram_size != 0u &&
        valid_memory_range(address, access_size, device->profile->flexram_address,
                           device->profile->flexram_size)) {
        if (!is_flash_access_allowed(device, access, flash_master_id, false))
            return false;
        return k22_data_read(device->data, address, access_size, output_value);
    }
    if (device->flexbus_memory != NULL &&
        valid_memory_range(address, access_size, device->flexbus_address, device->flexbus_size) &&
        k22_io_flexbus_transfer(&device->io, address, access_size, false, 0u)) {
        *output_value = read_little_endian(
            device->flexbus_memory + address - device->flexbus_address, access_size);
        return true;
    }
    return kinetis_peripheral_read(device, address, access_size, access, output_value);
}

static bool memory_write_unprotected(Kinetis* device, uint32_t address, uint8_t access_size,
                                     CortexM4Access access, uint8_t flash_master_id,
                                     uint32_t write_value) {
    if (valid_memory_range(address, access_size, K22_FLASH_BASE,
                           device->configuration.flash_size)) {
        if (access != CORTEX_M4_ACCESS_DEBUG) {
            return false;
        }
        for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
            device->flash[k22_data_program_flash_address(device->data, address + byte_index)] =
                (uint8_t)(write_value >> (byte_index * 8u));
        }
        fmc_invalidate_line(device, 0u, address);
        fmc_invalidate_line(device, 0u, address + access_size - 1u);
        return true;
    }
    if (valid_memory_range(address, access_size, device->sram_base,
                           device->configuration.sram_size)) {
        const uint32_t offset = address - device->sram_base;
        write_little_endian(device->sram + offset, access_size, write_value);
        memset(device->sram_initialized + offset, 1, access_size);
        return true;
    }
    if (device->profile->flexnvm_size != 0u &&
        valid_memory_range(address, access_size, device->profile->flexnvm_address,
                           device->profile->flexnvm_size)) {
        if (access != CORTEX_M4_ACCESS_DEBUG ||
            !k22_data_write(device->data, address, access_size, write_value))
            return false;
        const uint32_t offset = address - device->profile->flexnvm_address;
        fmc_invalidate_line(device, 1u, offset);
        fmc_invalidate_line(device, 1u, offset + access_size - 1u);
        return true;
    }
    if (device->profile->flexram_size != 0u &&
        valid_memory_range(address, access_size, device->profile->flexram_address,
                           device->profile->flexram_size)) {
        if (!is_flash_access_allowed(device, access, flash_master_id, true))
            return false;
        return k22_data_write(device->data, address, access_size, write_value);
    }
    if (device->flexbus_memory != NULL && !device->flexbus_read_only &&
        valid_memory_range(address, access_size, device->flexbus_address, device->flexbus_size) &&
        k22_io_flexbus_transfer(&device->io, address, access_size, true, write_value)) {
        write_little_endian(device->flexbus_memory + address - device->flexbus_address, access_size,
                            write_value);
        return true;
    }
    return kinetis_peripheral_write(device, address, access_size, access, write_value);
}

bool kinetis_memory_read(Kinetis* device, uint32_t address, uint8_t access_size,
                         CortexM4Access access, uint32_t* output_value) {
    if (device == NULL || output_value == NULL ||
        (access_size != 1u && access_size != 2u && access_size != 4u))
        return false;
    if (access != CORTEX_M4_ACCESS_DEBUG) {
        const uint8_t master_id = access == CORTEX_M4_ACCESS_INSTRUCTION ? 0u : 1u;
        const bool supervisor = access != CORTEX_M4_ACCESS_UNPRIVILEGED_DATA &&
                                (access != CORTEX_M4_ACCESS_INSTRUCTION || device->cpu == NULL ||
                                 (cortex_m4_get_xpsr(device->cpu) & 0x1ffu) != 0u ||
                                 (cortex_m4_get_control(device->cpu) & 1u) == 0u);
        const K22SysMpuAccess operation =
            access == CORTEX_M4_ACCESS_INSTRUCTION ? K22_SYSMPU_EXECUTE : K22_SYSMPU_READ;
        if (!sysmpu_access_allowed(device, address, access_size, master_id, supervisor, operation))
            return false;
    }
    const uint8_t master_id = access == CORTEX_M4_ACCESS_INSTRUCTION ? 0u : 1u;
    return memory_read_unprotected(device, address, access_size, access, master_id, output_value);
}

bool kinetis_memory_write(Kinetis* device, uint32_t address, uint8_t access_size,
                          CortexM4Access access, uint32_t write_value) {
    if (device == NULL || (access_size != 1u && access_size != 2u && access_size != 4u))
        return false;
    if (access != CORTEX_M4_ACCESS_DEBUG) {
        const bool supervisor = access != CORTEX_M4_ACCESS_UNPRIVILEGED_DATA;
        if (!sysmpu_access_allowed(device, address, access_size, 1u, supervisor, K22_SYSMPU_WRITE))
            return false;
    }
    return memory_write_unprotected(device, address, access_size, access, 1u, write_value);
}

