tylertms/kinetis-k22-sim/src/device/kinetis/device.c
bool kinetis_dma_read(Kinetis* device, uint32_t address, uint8_t access_size,
                      uint32_t* output_value) {
    if (device == NULL || output_value == NULL ||
        (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !sysmpu_access_allowed(device, address, access_size, 2u, true, K22_SYSMPU_READ))
        return false;
    return memory_read_unprotected(device, address, access_size, CORTEX_M4_ACCESS_DATA, 2u,
                                   output_value);
}

bool kinetis_dma_write(Kinetis* device, uint32_t address, uint8_t access_size,
                       uint32_t write_value) {
    if (device == NULL || (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !sysmpu_access_allowed(device, address, access_size, 2u, true, K22_SYSMPU_WRITE))
        return false;
    return memory_write_unprotected(device, address, access_size, CORTEX_M4_ACCESS_DATA, 2u,
                                    write_value);
}

bool kinetis_flash_controller_write(Kinetis* device, uint32_t address, uint8_t access_size,
                                    uint32_t write_value) {
    if (device == NULL || (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !valid_memory_range(address, access_size, K22_FLASH_BASE, device->configuration.flash_size))
        return false;
    write_little_endian(device->flash + address, access_size, write_value);
    return true;
}

static const K22RegisterDescriptor* bit_band_descriptor(const Kinetis* device,
                                                        uint32_t register_byte_address) {
    for (size_t register_index = 0; register_index < device->manifest->register_count;
         register_index++) {
        const K22RegisterDescriptor* descriptor = &device->manifest->registers[register_index];
        const uint8_t register_size = (uint8_t)(descriptor->width / 8u);
        if (register_byte_address >= descriptor->address &&
            register_byte_address - descriptor->address < register_size) {
            return descriptor;
        }
    }
    return NULL;
}

static bool bit_band_read(Kinetis* device, uint32_t address, CortexM4Access access,
                          uint32_t* output_value) {
    if ((address & 3u) != 0) {
        return false;
    }
    const uint32_t alias_address = address - K22_BIT_BAND_BASE;
    const uint32_t register_byte_address = K22_PERIPHERAL_BASE + alias_address / 32u;
    const uint8_t bit_index = (uint8_t)((alias_address / 4u) & 7u);
    const K22RegisterDescriptor* descriptor = bit_band_descriptor(device, register_byte_address);
    if (descriptor == NULL || (descriptor->access & K22_REGISTER_ACCESS_READ) == 0) {
        return false;
    }
    const uint8_t register_bit =
        (uint8_t)((register_byte_address - descriptor->address) * 8u + bit_index);
    const uint32_t bit_mask = 1u << register_bit;
    if ((descriptor->implemented_mask & descriptor->read_mask & bit_mask) == 0) {
        return false;
    }
    uint32_t register_value = 0u;
    if (!kinetis_peripheral_read(device, descriptor->address, (uint8_t)(descriptor->width / 8u),
                                 access, &register_value)) {
        return false;
    }
    *output_value = (register_value & bit_mask) != 0;
    return true;
}

static bool bit_band_write(Kinetis* device, uint32_t address, CortexM4Access access,
                           uint32_t write_value) {
    if ((address & 3u) != 0) {
        return false;
    }
    const uint32_t alias_address = address - K22_BIT_BAND_BASE;
    const uint32_t register_byte_address = K22_PERIPHERAL_BASE + alias_address / 32u;
    const uint8_t bit_index = (uint8_t)((alias_address / 4u) & 7u);
    const K22RegisterDescriptor* descriptor = bit_band_descriptor(device, register_byte_address);
    if (descriptor == NULL || (descriptor->access & K22_REGISTER_ACCESS_WRITE) == 0) {
        return false;
    }
    const uint8_t register_bit =
        (uint8_t)((register_byte_address - descriptor->address) * 8u + bit_index);
    const uint32_t bit_mask = 1u << register_bit;
    if ((descriptor->implemented_mask & descriptor->write_mask & bit_mask) == 0) {
        return false;
    }
    uint32_t register_value = 0u;
    if (!kinetis_peripheral_read(device, descriptor->address, (uint8_t)(descriptor->width / 8u),
                                 access, &register_value)) {
        return false;
    }
    register_value &= ~descriptor->w1c_mask;
    if ((descriptor->w1c_mask & bit_mask) != 0) {
        if ((write_value & 1u) != 0) {
            register_value |= bit_mask;
        }
    } else {
        register_value =
            (write_value & 1u) != 0 ? register_value | bit_mask : register_value & ~bit_mask;
    }
    return kinetis_peripheral_write(device, descriptor->address, (uint8_t)(descriptor->width / 8u),
                                    access, register_value);
}

static bool k22_read_bus(void* context, uint32_t address, uint8_t access_size,
                         CortexM4Access access, uint32_t* output_value) {
    Kinetis* device = context;
    if (address >= K22_BIT_BAND_BASE && address < K22_BIT_BAND_BASE + K22_BIT_BAND_SIZE) {
        if (access_size != 1u && access_size != 2u && access_size != 4u)
            return false;
        return bit_band_read(device, address, access, output_value);
    }
    return kinetis_memory_read(device, address, access_size, access, output_value);
}

static bool k22_write_bus(void* context, uint32_t address, uint8_t access_size,
                          CortexM4Access access, uint32_t write_value) {
    Kinetis* device = context;
    if (address >= K22_BIT_BAND_BASE && address < K22_BIT_BAND_BASE + K22_BIT_BAND_SIZE) {
        if (access_size != 1u && access_size != 2u && access_size != 4u)
            return false;
        return bit_band_write(device, address, access, write_value);
    }
    return kinetis_memory_write(device, address, access_size, access, write_value);
}

static void k22_advance_bus(void* context, uint32_t cycle_count) {
    Kinetis* device = context;
    device->cycles += cycle_count;
    kinetis_peripheral_advance(device, cycle_count);
}

static void k22_reset_bus(void* context) { kinetis_warm_reset(context, 0, 0x04u); }

KinetisConfiguration kinetis_configuration(KinetisProfile profile_id) {
    KinetisConfiguration configuration;
    const K22Profile* profile = k22_profile_get(profile_id);
    memset(&configuration, 0, sizeof(configuration));
    configuration.profile = profile_id;
    configuration.package = KINETIS_PACKAGE_DEFAULT;
    if (profile != NULL) {
        configuration.flash_size = profile->program_flash_size;
        configuration.sram_size = profile->sram_lower_size + profile->sram_upper_size;
    }
    configuration.external_oscillator_hz = 8000000u;
    configuration.rtc_oscillator_hz = 32768u;
    return configuration;
}

KinetisConfiguration kinetis_default_configuration(void) {
    return kinetis_configuration(KINETIS_PROFILE_MK22FN51212);
}

bool kinetis_profile_from_name(const char* name, KinetisProfile* profile) {
    const K22Profile* match = k22_profile_find(name);
    if (match == NULL || profile == NULL) {
        return false;
    }
    *profile = match->id;
    return true;
}

const char* kinetis_profile_name(KinetisProfile profile) {
    const K22Profile* match = k22_profile_get(profile);
    return match == NULL ? NULL : match->name;
}

