tylertms/kinetis-k22-sim/src/device/kinetis/device.c
bool kinetis_package_from_code(const char* code, KinetisPackage* package) {
    const K22Package* match = k22_package_find(code);
    if (match == NULL || package == NULL) {
        return false;
    }
    *package = (KinetisPackage)match->id;
    return true;
}

const char* kinetis_package_code(KinetisPackage package) {
    if (package == KINETIS_PACKAGE_DEFAULT) {
        return NULL;
    }
    const K22Package* match = k22_package_get((K22PackageId)package);
    return match == NULL ? NULL : match->code;
}

static void destroy_partial_device(Kinetis* device) {
    if (device == NULL) {
        return;
    }
    cortex_m4_destroy(device->cpu);
    k22_data_destroy(device->data);
    k22_sdhc_destroy(&device->sdhc);
    free(device->flexbus_memory);
    free(device->flash);
    free(device->sram);
    free(device->sram_initialized);
    free(device->peripheral);
    free(device);
}

Kinetis* kinetis_create(KinetisConfiguration configuration) {
    const K22Profile* profile = k22_profile_get(configuration.profile);
    const K22RegisterManifest* manifest = k22_register_manifest_get(configuration.profile);
    if (profile == NULL || manifest == NULL) {
        return NULL;
    }
    const K22PackageSelection* package_selection =
        configuration.package == KINETIS_PACKAGE_DEFAULT
            ? k22_package_default(profile)
            : k22_package_select(profile, (K22PackageId)configuration.package);
    if (package_selection == NULL || configuration.flash_size == 0 ||
        configuration.flash_size > profile->program_flash_size || configuration.sram_size == 0 ||
        configuration.sram_size > 0x40000000u) {
        return NULL;
    }
    Kinetis* device = calloc(1, sizeof(*device));
    if (device == NULL) {
        return NULL;
    }
    device->configuration = configuration;
    device->first_uninitialized_sram_read = UINT32_MAX;
    device->profile = profile;
    device->package = package_selection;
    device->manifest = manifest;
    const size_t profile_sram_size = (size_t)profile->sram_lower_size + profile->sram_upper_size;
    device->sram_base = configuration.sram_size == profile_sram_size
                            ? profile->sram_lower_address
                            : K22_SRAM_CENTER - (uint32_t)(configuration.sram_size / 2u);
    device->flash = malloc(configuration.flash_size);
    device->sram = calloc(1, configuration.sram_size);
    device->sram_initialized = calloc(1, configuration.sram_size);
    device->peripheral = calloc(1, K22_PERIPHERAL_SIZE);
    if (device->flash == NULL || device->sram == NULL || device->sram_initialized == NULL ||
        device->peripheral == NULL) {
        destroy_partial_device(device);
        return NULL;
    }
    memset(device->flash, 0xff, configuration.flash_size);
    if (!k22_serial_init(&device->serial, profile) ||
        !k22_sdhc_init(&device->sdhc, kinetis_sdhc_bus(device)) ||
        !k22_timing_init(&device->timing, profile, configuration.external_oscillator_hz,
                         configuration.rtc_oscillator_hz, kinetis_timing_signals(device)) ||
        !k22_io_init(&device->io, kinetis_io_configuration(device))) {
        destroy_partial_device(device);
        return NULL;
    }
    device->data = k22_data_create(profile, kinetis_data_bus(device));
    if (device->data == NULL) {
        destroy_partial_device(device);
        return NULL;
    }
    kinetis_sync_clock_gates(device);
    CortexM4Bus bus = {device, k22_read_bus, k22_write_bus, k22_advance_bus, k22_reset_bus};
    device->cpu = cortex_m4_create(bus);
    if (device->cpu == NULL ||
        !cortex_m4_configure_implementation(device->cpu, profile->cpu.external_irq_count,
                                            profile->cpu.nvic_priority_bits,
                                            profile->cpu.has_mpu ? 8u : 0u)) {
        destroy_partial_device(device);
        return NULL;
    }
    return device;
}

void kinetis_destroy(Kinetis* device) { destroy_partial_device(device); }

CortexM4* kinetis_cpu(Kinetis* device) { return device == NULL ? NULL : device->cpu; }

const CortexM4* kinetis_cpu_const(const Kinetis* device) {
    return device == NULL ? NULL : device->cpu;
}

static void sync_flash_configuration(Kinetis* device) {
    K22PeripheralBlock block;
    if (!k22_profile_peripheral_block(device->profile, K22_PERIPHERAL_FLASH_CONFIG, &block) ||
        block.address + block.size > device->configuration.flash_size) {
        return;
    }
    (void)k22_data_set_flash_configuration(device->data, device->flash + block.address, block.size);
    memcpy(device->io.configuration.flash_configuration, device->flash + block.address, block.size);
}

bool kinetis_reset(Kinetis* device) {
    if (device == NULL) {
        return false;
    }
    memset(device->sram, 0, device->configuration.sram_size);
    memset(device->sram_initialized, 0, device->configuration.sram_size);
    device->uninitialized_sram_read_count = 0u;
    device->first_uninitialized_sram_read = UINT32_MAX;
    device->cycles = 0;
    device->timing.elapsed_core_cycles = 0;
    sync_flash_configuration(device);
    kinetis_peripheral_reset(device);
    k22_timing_reset(&device->timing, 0x82u, 0);
    kinetis_sync_clock_gates(device);
    const bool reset_succeeded =
        cortex_m4_reset(device->cpu, device->configuration.vector_table_address);
    fmc_clear_cache(device);
    return reset_succeeded;
}

void kinetis_warm_reset(Kinetis* device, uint8_t reset_cause_0, uint8_t reset_cause_1) {
    if (device == NULL) {
        return;
    }
    device->uninitialized_sram_read_count = 0u;
    device->first_uninitialized_sram_read = UINT32_MAX;
    uint8_t retained_vbat[0x20];
    memcpy(retained_vbat, device->peripheral + 0x3e000u, sizeof(retained_vbat));
    sync_flash_configuration(device);
    kinetis_peripheral_reset(device);
    memcpy(device->peripheral + 0x3e000u, retained_vbat, sizeof(retained_vbat));
    k22_timing_warm_reset(&device->timing, reset_cause_0, reset_cause_1);
    kinetis_sync_clock_gates(device);
    (void)cortex_m4_reset(device->cpu, device->configuration.vector_table_address);
    fmc_clear_cache(device);
}

bool kinetis_load(Kinetis* device, uint32_t address, const void* input_data, size_t data_size) {
    if (device == NULL || input_data == NULL) {
        return false;
    }
    if (address < device->configuration.flash_size &&
        (uint64_t)address + data_size <= device->configuration.flash_size) {
        memcpy(device->flash + address, input_data, data_size);
        fmc_clear_cache(device);
        sync_flash_configuration(device);
        return true;
    }
    if (address >= device->sram_base &&
        (uint64_t)address + data_size <=
            (uint64_t)device->sram_base + device->configuration.sram_size) {
        memcpy(device->sram + address - device->sram_base, input_data, data_size);
        memset(device->sram_initialized + address - device->sram_base, 1, data_size);
        return true;
    }
    return false;
}

bool kinetis_seed(Kinetis* device, uint32_t address, const void* input_data, size_t data_size) {
    return kinetis_write(device, address, input_data, data_size);
}

bool kinetis_read(const Kinetis* device, uint32_t address, void* output_data, size_t data_size) {
    if (device == NULL || output_data == NULL) {
        return false;
    }
    uint8_t* output_bytes = output_data;
    size_t byte_offset = 0u;
    while (byte_offset < data_size) {
        const size_t remaining_bytes = data_size - byte_offset;
        const uint8_t access_size = remaining_bytes >= 4 && ((address + byte_offset) & 3u) == 0 ? 4
                                    : remaining_bytes >= 2 && ((address + byte_offset) & 1u) == 0
                                        ? 2
                                        : 1;
        uint32_t transfer_value = 0u;
        if (!k22_read_bus((Kinetis*)device, address + (uint32_t)byte_offset, access_size,
                          CORTEX_M4_ACCESS_DEBUG, &transfer_value)) {
            return false;
        }
        write_little_endian(output_bytes + byte_offset, access_size, transfer_value);
        byte_offset += access_size;
    }
    return true;
}

bool kinetis_write(Kinetis* device, uint32_t address, const void* input_data, size_t data_size) {
    if (device == NULL || input_data == NULL) {
        return false;
    }
    const uint8_t* input_bytes = input_data;
    size_t byte_offset = 0u;
    while (byte_offset < data_size) {
        const size_t remaining_bytes = data_size - byte_offset;
        const uint8_t access_size = remaining_bytes >= 4 && ((address + byte_offset) & 3u) == 0 ? 4
                                    : remaining_bytes >= 2 && ((address + byte_offset) & 1u) == 0
                                        ? 2
                                        : 1;
        const uint32_t transfer_value = read_little_endian(input_bytes + byte_offset, access_size);
        if (!k22_write_bus(device, address + (uint32_t)byte_offset, access_size,
                           CORTEX_M4_ACCESS_DEBUG, transfer_value)) {
            return false;
        }
        byte_offset += access_size;
    }
    return true;
}

bool kinetis_copy(Kinetis* destination, const Kinetis* source) {
    if (destination == NULL || source == NULL || destination->profile->id != source->profile->id ||
        destination->package != source->package ||
        destination->configuration.flash_size != source->configuration.flash_size ||
        destination->configuration.sram_size != source->configuration.sram_size) {
        return false;
    }
    memcpy(destination->flash, source->flash, source->configuration.flash_size);
    memcpy(destination->sram, source->sram, source->configuration.sram_size);
    memcpy(destination->sram_initialized, source->sram_initialized,
           source->configuration.sram_size);
    memcpy(destination->peripheral, source->peripheral, K22_PERIPHERAL_SIZE);
    destination->configuration = source->configuration;
    destination->uninitialized_sram_read_count = source->uninitialized_sram_read_count;
    destination->first_uninitialized_sram_read = source->first_uninitialized_sram_read;
    destination->cycles = source->cycles;
    destination->cmt_cycles = source->cmt_cycles;
    destination->cmt_bus_remainder = source->cmt_bus_remainder;
    destination->cmt_mark_ticks = source->cmt_mark_ticks;
    destination->cmt_period_ticks = source->cmt_period_ticks;
    destination->cmt_carrier_high_ticks = source->cmt_carrier_high_ticks;
    destination->cmt_carrier_period_ticks = source->cmt_carrier_period_ticks;
    destination->cmt_carrier_offset_ticks = source->cmt_carrier_offset_ticks;
    destination->cmt_output_delay_ticks = source->cmt_output_delay_ticks;
    destination->cmt_eoc_read = source->cmt_eoc_read;
    destination->cmt_running = source->cmt_running;
    destination->cmt_stop_pending = source->cmt_stop_pending;
    destination->cmt_fsk_secondary = source->cmt_fsk_secondary;
    destination->cmt_extended_space = source->cmt_extended_space;
    destination->cmt_dma_pending = source->cmt_dma_pending;
    memcpy(destination->fmc_bank, source->fmc_bank, sizeof(destination->fmc_bank));
    memcpy(destination->fmc_age, source->fmc_age, sizeof(destination->fmc_age));
    destination->fmc_access_count = source->fmc_access_count;
    (void)k22_usbdcd_copy(&destination->usbdcd, &source->usbdcd);
    memcpy(destination->comparator_output, source->comparator_output,
           sizeof(destination->comparator_output));
    memcpy(destination->events, source->events, sizeof(destination->events));
    destination->event_read_index = source->event_read_index;
    destination->event_write_index = source->event_write_index;
    destination->event_count = source->event_count;
    if (!k22_data_copy(destination->data, source->data) ||
        !k22_sdhc_copy(&destination->sdhc, &source->sdhc, kinetis_sdhc_bus(destination)) ||
        !k22_serial_copy(&destination->serial, &source->serial) ||
        !k22_io_copy(&destination->io, &source->io) ||
        !k22_timing_copy(&destination->timing, &source->timing,
                         kinetis_timing_signals(destination))) {
        return false;
    }
    destination->io.configuration.event_handler =
        kinetis_io_configuration(destination).event_handler;
    destination->io.configuration.event_context = destination;
    if (source->flexbus_memory != NULL) {
        if (!kinetis_flexbus_attach(destination, source->flexbus_address, source->flexbus_memory,
                                    source->flexbus_size, source->flexbus_read_only))
            return false;
    } else {
        kinetis_flexbus_detach(destination);
    }
    return cortex_m4_copy(destination->cpu, source->cpu);
}

